const questions = [
    {
        idx: 1,
        type: 1,
        question: '以下何種資源物不可回收？',
        options: [
            '塑膠飲料杯',
            '塑膠打包繩',
            '直接接觸麵包的塑膠袋',
            '牛奶紙盒包'
        ],
        ans: 3,
        desc: '直接接觸食物的塑膠袋是屬於一般垃圾喔！'
    },
    {
        idx: 2,
        type: 1,
        question: '關於回收廢乾電池，下列何者為非？',
        options: [
            '丟到水溝裡',
            '拿到便利商店',
            '交付清潔隊',
            '至村里資收站回收'
        ],
        ans: 1,
        desc: '廢乾電池請勿隨意棄置，以免造成環境污染，可以拿到便利商店、交給清潔隊或拿到村里資收站進行回收。'
    },
    {
        idx: 3,
        type: 1,
        question: '以下何種物品需要回收？',
        options: [
            '電子發票',
            '大餅的塑膠襯盒',
            '尼龍雨衣',
            '尼龍繩'
        ],
        ans: 2,
        desc: '塑膠盒是屬於回收物。電子發票、尼龍雨衣和尼龍繩屬於一般垃圾喔！'
    },
    {
        idx: 4,
        type: 1,
        question: '如果沒有做好垃圾分類，會被罰款多少呢？',
        options: [
            '1,200~6,000元',
            '6,000~12,000元',
            '12,000~18,000元',
            '18,000~24,000元'
        ],
        ans: 1,
        desc: '如無做好分類將依廢棄物清理法第12條規定，處1,200~6,000元罰鍰。'
    },
    {
        idx: 5,
        type: 1,
        question: '垃圾分3類是哪3類？',
        options: [
            '一般垃圾',
            '資源回收',
            '廚餘類',
            '以上皆是'
        ],
        ans: 4,
        desc: '垃圾分類分為一般垃圾、資源回收以及廚餘類。'
    },
    {
        idx: 6,
        type: 1,
        question: '下列何項是金門特有的可回收項目',
        options: [
            '乾電池',
            '蚵殼',
            '紙箱',
            '乾淨塑膠袋'
        ],
        ans: 2,
        desc: '蚵殼可以在金門就地處理，可以用來調整土壤酸鹼值，以及作為鋪設道路的材料。'
    },
    {
        idx: 7,
        type: 1,
        question: '住戶任意棄置垃圾包，致造成環境髒亂，上述行為業已違反？',
        options: [
            '廢棄物清理法',
            '廣告物管理辦法',
            '空氣污染防制法',
            '以上皆是'
        ],
        ans: 1,
        desc: '隨意丟棄垃圾依照廢棄物清理法第12條規定，處1,200~6,000元罰鍰。'
    },
    {
        idx: 8,
        type: 1,
        question: '容器類回收前處理步驟以下何者排列正確？A:分類回收、B沖洗、C隨意丟棄、D壓扁',
        options: [
            'A→B→C',
            'B→C→D',
            'B→D→A',
            'D→A→B'
        ],
        ans: 3,
        desc: '容器類回收前處理正確步驟為沖洗→壓扁→分類回收。'
    },
    {
        idx: 9,
        type: 1,
        question: '廢棄機車回收目前獎勵金是多少錢？',
        options: [
            '100元',
            '200元',
            '300元',
            '400元'
        ],
        ans: 3,
        desc: '目前廢棄機車回收獎勵金為300元喔！'
    },
    {
        idx: 10,
        type: 1,
        question: '使用過的廢食用油要如何處理呢？',
        options: [
            '裝入寶特瓶並加蓋，再交由資源回收車回收',
            '直接倒入水槽',
            '直接丟入垃圾桶',
            '倒入廚餘桶回收'
        ],
        ans: 1,
        desc: '使用過的廢食用油請裝瓶並加蓋另外交由清潔隊資源回收車處理。'
    },
    {
        idx: 11,
        type: 1,
        question: '占用道路無牌汽機車查報處理單位為何機關負責？',
        options: [
            '環保局',
            '警察局',
            '產業發展局',
            '交通局'
        ],
        ans: 1,
        desc: '占用道路無牌汽機車查報處理單位為環保局負責。'
    },
    {
        idx: 12,
        type: 1,
        question: '哪項物品可以丟到紙類專車裡面呢？',
        options: [
            '鋁箔包',
            '新鮮屋紙盒包',
            '紙便當盒',
            '紙箱'
        ],
        ans: 4,
        desc: '鋁箔包、新鮮屋紙盒包及紙便當盒含有防水薄膜，屬於紙容器類，需丟到資源回收車中。'
    },
    {
        idx: 13,
        type: 1,
        question: '落實資源回收，對環境有什麼幫助?',
        options: [
            '減少垃圾量產生',
            '延長焚化爐或掩埋場壽命',
            '促進資源循環再利用',
            '以上皆是'
        ],
        ans: 4,
        desc: '落實垃圾分類對於減少垃圾量產生、延長焚化爐或掩埋場壽命及促進資源循環再利用都是很有幫助的喔!'
    },
    {
        idx: 14,
        type: 2,
        question: '以下何種方式無法減少使用全新購物用塑膠袋？',
        options: [
            '自備購物袋',
            '使用資源循環箱裡的提袋',
            '直接用手拿',
            '跟店家購買塑膠袋'
        ],
        ans: 4,
        desc: '以自備購物袋及重複使用提袋取代購買全新塑膠袋!'
    },
    {
        idx: 15,
        type: 2,
        question: '以下何者無法減少使用一次性餐具？',
        options: [
            '自備環保杯',
            '自備環保餐盒',
            '跟店家要一次用塑膠吸管',
            '自備環保吸管'
        ],
        ans: 3,
        desc: '請減少使用一次性餐具。'
    },
    {
        idx: 16,
        type: 2,
        question: '環保署自108年7月1日起的新政策是什麼限制使用的東西呢？',
        options: [
            '購物用塑膠袋',
            '紙盒包',
            '塑膠餐盒',
            '內用一次性塑膠吸管'
        ],
        ans: 4,
        desc: '環保署明訂108年7月1日起包含公部門、公私立學校、百貨公司及購物中心、連鎖速食店等業者不得提供內用者一次用塑膠吸管。'
    },
    {
        idx: 17,
        type: 2,
        question: '「資源循環箱」中裝有環保提袋，鄉親忘記攜帶購物袋都可以至循環箱取用，金門縣許多商店設有資源循環箱，請問下列何者有設置呢？',
        options: [
            '家樂福',
            '全聯',
            '漁會生鮮超市',
            '以上皆是'
        ],
        ans: 4,
        desc: '家樂福、全聯、漁會生鮮超市、樂多大超市、金城聯、金莎大賣場、及部分便利商店均有設置「資源循環箱」歡迎大家多加利用。'
    },
    {
        idx: 18,
        type: 2,
        question: '如有自己穿不到但狀態還不錯的舊衣服以下處理和者不恰當呢？',
        options: [
            '直接丟到垃圾車中',
            '交由資源回收車回收',
            '至二手商店販賣',
            '縫製成環保袋'
        ],
        ans: 1,
        desc: '還有價值的舊衣服最好能再利用或尋找新主人，都是很好的做法喔。'
    },
    {
        idx: 19,
        type: 3,
        question: '以下何項不屬於廚餘回收？',
        options: [
            '吃剩的麵包',
            '沒吃完的炒飯',
            '串燒裡的竹籤',
            '早餐的三明治'
        ],
        ans: 3,
        desc: '竹籤、竹筷、塑膠綁帶等，都屬於一般垃圾，請勿丟到廚餘回收唷!'
    },
    {
        idx: 20,
        type: 3,
        question: '以下何項不屬於廚餘回收？',
        options: [
            '裝麵包的塑膠袋',
            '鳳梨頭',
            '花生殼',
            '蘋果皮'
        ],
        ans: 1,
        desc: '金門縣的廚餘回收都是作為堆肥喔，所以果皮果核和硬殼類都要回收，要注意竹籤、竹筷、塑膠袋等，都屬於一般垃圾，請勿丟到廚餘回收唷!'
    }
];

let currentList = questions;
let wrongList = [];

function randomSelect() {
    if (currentList.length === 0) {
        currentList = wrongList;
        wrongList = [];
        console.log(JSON.stringify(currentList));
        console.log(JSON.stringify(wrongList));
    }
    const range = currentList.length - 1;
    const randomNum = Math.ceil(Math.random() * range);
    return currentList.splice(randomNum, 1)[0];
}